# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  # - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  # - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  # - [-1, 3, C2f, [128, True]]      # 2   #1
  # - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  # - [-1, 6, C2f, [256, True]]     # 4   #2
  # - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  # - [-1, 6, C2f, [512, True]]      # 6   #3
  # - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  # - [-1, 3, C2f, [1024, True]]     # 8   #4
  # - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, fasternet_t1, ['fasternet_t1.pth']]  # 4
  #- [-1, 1, fasternet_t0, []]
  - [-1, 1, SPPF, [1024, 5]]  # 5
# YOLOv8.0-p2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 6
  - [[-1, 3], 1, Concat, [1]] # cat backbone P4   
  - [-1, 3, C2f, [512]] # 12   #8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 9
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)       # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 10
  - [[-1, 1], 1, Concat, [1]] # cat backbone P2 
  - [-1, 3, C2f, [128]] # 18 (P2/4-xsmall)    # 14

  - [-1, 1, Conv, [128, 3, 2]]         # 13
  - [[-1, 11], 1, Concat, [1]] # cat head P3
  - [-1, 3, C2f, [256]] # 21 (P3/8-small)       # 17

  - [-1, 1, Conv, [256, 3, 2]]       # 16
  - [[-1, 8], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 24 (P4/16-medium)   # 20

  - [-1, 1, Conv, [512, 3, 2]]    # 19
  - [[-1, 5], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 27 (P5/32-large)   # 23

  - [[4, 14, 17, 20, 23], 1, Detect_featureloss, [nc]] # Detect(P2, P3, P4, P5)
